{
    "home": "Accueil",
    "quiz": "Quiz",
    "results": "Résultats",

    "credits": "Crédits",
    "ideaBy": "Idée par",
    "builtBy": "Développé par",
    "ryane": "Saada Ryane Afnoukh",
    "yacine": "Yacine Hamdine",
    "samy": "Samy Berrich",
    "about": "À propos",
    "infos": "WeshNekra est une solution qui aide les étudiants à choisir leur parcours académique supérieur à travers un quiz catégorisé et spécialisé. C'est un projet développé en 2025 par un groupe d'étudiants à Alger, Algérie.",
    "copyright": "Tous droits réservés",

    "heroTitle": "Déterminez Votre Parcours Académique en Toute Simplicité",
    "heroText": "Bienvenue sur notre plateforme dédiée aux futurs étudiants universitaire ! Nous vous aidons à explorer vos passions et à choisir le domaine qui vous correspond le mieux.",
    "startQuiz": "Commencer",
    "specialQuiz": "Test Spécialisé",

    "exploreTitle": "Découvrez Nos Fonctionnalités Uniques et Interactives",
    "exploreText": "Nous proposons des quiz interactifs qui aident les nouveaux bacheliers à identifier leurs centres d'intérêt et leurs compétences. En fonction de leurs réponses, nous fournissons une liste de domaines recommandés correspondant à leur profil.",
    "feature1Title": "Quiz interactif pour évaluer vos intérêts",
    "feature1Text": "Faites notre quiz pour découvrir votre parcours.",
    "feature2Title": "Recommandations personnalisées basées sur vos réponses",
    "feature2Text": "Recevez des conseils sur mesure pour votre avenir.",
    "feature3Title": "Ressources éducatives pour approfondir vos connaissances",
    "feature3Text": "Accédez à des articles et guides utiles.",
    "knowMore": "En savoir plus >",

    "quizInstructions": "Instructions du Test",
    "quizInstruction1": "Chaque test se compose de 20 à 50 questions.",
    "quizInstruction2": "Pour chaque question, indiquez votre niveau d'accord sur une échelle de 0 à 5.",
    "quizInstruction3": "Prenez votre temps et répondez honnêtement pour obtenir les meilleurs résultats.",
    "quizWarningTitle": "Attention !",
    "quizWarningText": "Ce test est conçu uniquement comme un outil d’orientation. Il ne remplace en aucun cas une réflexion personnelle approfondie ou un accompagnement professionnel.",
    "quizSelect": "Choisissez un test pour commencer",
    "genCatName": "Test Général",
    "genCatDescription": "Ce test est conçu pour vous aider à identifier vos intérêts et compétences avec des résultats catégorisés.",
    "xctSciName": "Sciences Exactes",
    "xctSciDescription": "Mathématiques, Physique, Chimie et Sciences de l'Ingénieur.",
    "hmnSciName": "Sciences Humaines et Sociales",
    "hmnSciDescription": "Psychologie, Sociologie, Histoire et Sciences Politiques.",
    "lthSciName": "Sciences de la Santé",
    "lthSciDescription": "Médecine, Pharmacie et Sciences Biomédicales.",
    "lngLitName": "Langues et Littérature",
    "lngLitDescription": "Littérature, Linguistique et Traduction.",
    "ecnBsnName": "Économie et Gestion",
    "ecnBsnDescription": "Économie, Finance, Gestion et Marketing.",
    "sprSciName": "Sciences du Sport",
    "sprSciDescription": "Éducation Physique, Management du Sport et Coaching.",

    "howResultsAreCalculated": "Comment les résultats sont-ils calculés ?",
    "resultsCalculation": "Chaque question est associée à une catégorie/spécialité et à un score. Le résultat final est la somme des scores des questions dans chaque catégorie/spécialité.",
    "howToInterpretResults": "Comment interpréter les résultats ?",
    "resultsInterpretation": "Les résultats sont affichés sous forme de graphique à barres. La hauteur de chaque barre représente le score de la catégorie/spécialité. Plus la barre est haute, plus cette catégorie/spécialité correspond à votre profil et à vos intérêts.",
    "howToUseResults": "Comment utiliser les résultats ?",
    "resultsUsage": "Nous vous recommandons de prendre en compte les premières catégories/spécialités de vos résultats et de mener des recherches approfondies sur celles-ci ainsi que sur leurs opportunités professionnelles, aussi bien localement qu’à l’international."
}