{
    "home": "Accueil",
    "quiz": "Quiz",
    "results": "Résultats",

    "credits": "Crédits",
    "ideaBy": "Idée par",
    "builtBy": "Développé par",
    "ryane": "Saada Ryane Afnoukh",
    "yacine": "Yacine Hamdine",
    "abderraouf": "Abderraouf Chekroun",
    "samy": "Samy Berrich",
    "about": "À propos",
    "infos": "WeshNekra est une solution qui aide les étudiants à choisir leur orientation académique supérieure grâce à un quiz catégorisé et spécialisé. C'est un projet développé en 2025 par un groupe d'étudiants à Alger, Algérie.",
    "copyright": "Tous droits réservés",

    "heroTitle": "Déterminez Votre Parcours Académique Facilement",
    "heroText": "Bienvenue sur notre plateforme dédiée aux futurs étudiants universitaires ! Nous vous aidons à explorer vos passions et à choisir le domaine qui vous convient le mieux.",
    "startQuiz": "Commencer",
    "specialQuiz": "Spécial",

    "exploreTitle": "Découvrez Nos Fonctionnalités Uniques et Interactives",
    "exploreText": "Nous proposons des quiz interactifs qui aideront les nouveaux bacheliers à identifier leurs intérêts et compétences. En fonction des réponses, nous fournissons une liste de domaines recommandés qui correspondent à leur profil.",
    "feature1Title": "Quiz interactif pour évaluer vos intérêts",
    "feature1Text": "Répondez à notre quiz pour découvrir votre voie.",
    "feature2Title": "Recommandations personnalisées basées sur vos réponses",
    "feature2Text": "Recevez des conseils sur mesure pour votre avenir.",
    "feature3Title": "Ressources éducatives pour approfondir vos connaissances",
    "feature3Text": "Accédez à des articles et guides utiles.",
    "knowMore": "En savoir plus >",

    "quizInstructions": "Instructions des Tests",
    "quizInstruction1": "Chaque Quiz comprend 10-50 questions.",
    "quizInstruction2": "Pour chaque question, indiquez votre niveau d'accord sur une échelle de 1 à 5.",
    "quizInstruction3": "Prenez votre temps et répondez honnêtement pour obtenir les meilleurs résultats.",
    "quizWarningTitle": "Attention !",
    "quizWarningText": "Ce test est conçu uniquement comme un outil d'aide à l'orientation. Il ne remplace en aucun cas une réflexion personnelle approfondie ou un accompagnement professionnel.",
    "quizSelect": "Choisissez un Test pour commencer",
    "genCatName": "Test Général",
    "genCatDescription": "Ce test est conçu pour vous aider à identifier vos intérêts et compétences dans des résultats catégorisés.",
    "xctSciName": "Sciences Exactes",
    "xctSciDescription": "Mathématiques, Physique, Chimie et Sciences de l'Ingénieur.",
    "hmnSciName": "Sciences Humaines et Sociales",
    "hmnSciDescription": "Psychologie, Sociologie, Histoire et Sciences Politiques.",
    "lthSciName": "Sciences de la Santé",
    "lthSciDescription": "Médecine, Pharmacie et Sciences Biomédicales.",
    "lngLitName": "Langues et Littérature",
    "lngLitDescription": "Littérature, Linguistique et Traduction.",
    "ecnBsnName": "Économie et Gestion",
    "ecnBsnDescription": "Économie, Finance, Gestion et Marketing.",
    "sprSciName": "Sciences du Sport",
    "sprSciDescription": "Éducation Physique, Gestion du Sport et Coaching.",
    "arcDsgName": "Architecture",

    "howResultsAreCalculated": "Comment les Résultats Sont-ils Calculés ?",
    "resultsCalculation": "Chaque question est associée à une catégorie/spécialité et à un score. Le résultat final est calculé à l'aide d'un modèle/algorithme robuste que nous avons créé : \"Méthode de Scorage Alpha-Hybride\", une variante avec α=0.3.",
    "howToInterpretResults": "Comment Interpréter les Résultats ?",
    "resultsInterpretation": "Les résultats sont affichés sous forme de graphique à barres. La hauteur de chaque barre représente le score de la catégorie/spécialité. Plus la barre est haute, plus cette catégorie/spécialité correspond à votre profil et à vos intérêts.",
    "howToUseResults": "Comment Utiliser les Résultats ?",
    "resultsUsage": "Nous vous recommandons de prendre les premières catégories/spécialités de vos résultats et de mener des recherches approfondies à leur sujet et sur leurs opportunités professionnelles, tant au niveau local que mondial.",
    "savedResultsTitle": "Vos Quiz Enregistrés",
    "quizMeThis": "Faire le Quiz",
    "viewResult": "Voir les Résultats",
    "recommendedPath": "Parcours Recommandé",
    "continueQuiz": "Continuer le Quiz",

    "progress": "Progression",
    "quizRestart": "Recommencer",
    "quizNext": "Suivant",
    "quizPrevious": "Précédent",
    "disagree": "Totalement en Désaccord",
    "agree": "Totalement d'Accord",
    "finishQuiz": "Terminer",

    "kaitenVokse": "Kaiten Vokse Group",
    "ceo": "PDG",
    "cto": "Directeur technique",
    "dev": "Développeur",
    "missionTitle": "Notre Mission",
    "missionText": "Kaiten Vokse Group, fondé en 2025 par un groupe d'étudiants algériens innovants, est une société de services et de conseil en informatique avec une vision révolutionnaire. Notre nom combine le mot japonais “Kaiten” (qui signifie transformation ou révolution) et le mot norvégien “Vokse” (qui signifie grandir), reflétant ainsi notre mission principale : favoriser une croissance transformative à l’ère numérique. Nous sommes spécialisés dans la conception et le développement de systèmes informatiques robustes, la création de produits de pointe et la fourniture de services de conseil stratégiques permettant aux entreprises d'innover. À WeshNekra—notre projet phare conçu pour guider les étudiants dans le choix de leur parcours académique—nous exploitons les données, la technologie et les idées créatives pour aider à façonner un avenir meilleur. Notre mission est simple mais ambitieuse : révolutionner le monde grâce à l’innovation en informatique. Nous nous efforçons de créer des solutions qui ne se contentent pas de répondre aux défis d’aujourd’hui, mais qui posent également les bases de la croissance et de la transformation de demain. Inshallah, grâce à notre quête incessante d’excellence et d’innovation, nous contribuerons à un monde meilleur et plus connecté.",
    "teamTitle": "Notre Équipe",
    "teamText": "Nous sommes un groupe d'étudiants à Alger, en Algérie."

}