[
  {
    "id": "Q",
    "Qen": "I enjoy going on field trips to study soil layers, rock formations, and landscapes.",
    "Q": "J'aime participer à des sorties terrain pour étudier les couches de sol, les formations rocheuses et les paysages.",
    "Qar": "أستمتع بالرحلات الميدانية لدراسة طبقات التربة وتكوينات الصخور والمناظر الطبيعية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 5, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like using GIS and remote sensing tools to map land use and environmental changes.",
    "Q": "J'aime utiliser des outils SIG et de télédétection pour cartographier l'occupation des sols et les changements environnementaux.",
    "Qar": "أحب استخدام نظم المعلومات الجغرافية وأدوات الاستشعار عن بعد لرسم خرائط استخدام الأراضي والتغيرات البيئية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 5, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I am fascinated by climate modeling and predicting environmental impacts.",
    "Q": "Je suis fasciné par la modélisation climatique et la prévision des impacts environnementaux.",
    "Qar": "أنا مفتون بنمذجة المناخ وتوقع التأثيرات البيئية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 5, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy writing scripts to analyze large environmental datasets.",
    "Q": "J'aime écrire des scripts pour analyser de grands ensembles de données environnementales.",
    "Qar": "أستمتع بكتابة نصوص برمجية لتحليل مجموعات بيانات بيئية كبيرة.",
    "weights": {
      "cmp-ias": 2, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 4, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like evaluating sites for solar or wind farms based on environmental surveys.",
    "Q": "J'aime évaluer des sites pour des fermes solaires ou éoliennes en fonction d'enquêtes environnementales.",
    "Qar": "أحب تقييم مواقع مزارع الطاقة الشمسية أو الريحية بناءً على المسوحات البيئية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 1, "ren-eng": 3,
      "fnd-sci": 0, "ert-env": 3, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy experimenting with crop rotation and soil fertility techniques in school projects.",
    "Q": "J'aime expérimenter la rotation des cultures et les techniques de fertilité du sol dans les projets scolaires.",
    "Qar": "أستمتع بتجربة تناوب المحاصيل وتقنيات خصوبة التربة في المشاريع المدرسية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 5, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like developing new food processing methods in the lab and testing nutrition outcomes.",
    "Q": "J'aime développer de nouvelles méthodes de transformation alimentaire au laboratoire et tester les résultats nutritionnels.",
    "Qar": "أحب تطوير طرق جديدة لمعالجة الغذاء في المختبر واختبار نتائج التغذية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 5, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I am fascinated by designing bioreactors for fermentation and biotechnology applications.",
    "Q": "Je suis fasciné par la conception de bioréacteurs pour les applications de fermentation et de biotechnologie.",
    "Qar": "أنا مفتون بتصميم المفاعلات الحيوية لتطبيقات التخمير والتكنولوجيا الحيوية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 5, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like analyzing enzyme kinetics and biochemical pathways.",
    "Q": "J'aime analyser la cinétique des enzymes et les voies biochimiques.",
    "Qar": "أحب تحليل حركية الإنزيمات والمسارات البيوكيميائية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 4, "smt-phc": 2,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy designing sustainable agricultural equipment and farm machinery.",
    "Q": "J'aime concevoir du matériel agricole et des machines de ferme durables.",
    "Qar": "أستمتع بتصميم معدات زراعية وآلات مزرعية مستدامة.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 2, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 3, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy synthesizing new materials and testing their mechanical and chemical properties.",
    "Q": "J'aime synthétiser de nouveaux matériaux et tester leurs propriétés mécaniques et chimiques.",
    "Qar": "أستمتع بتخليق مواد جديدة واختبار خصائصها الميكانيكية والكيميائية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 5,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like using spectroscopy and electron microscopy to characterize substances.",
    "Q": "J'aime utiliser la spectroscopie et la microscopie électronique pour caractériser les substances.",
    "Qar": "أحب استخدام التحليل الطيفي والمجهر الإلكتروني لوصف المواد.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 5,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I am fascinated by reaction kinetics and thermodynamics experiments.",
    "Q": "Je suis fasciné par les expériences de cinétique des réactions et de thermodynamique.",
    "Qar": "أنا مفتون بتجارب حركية التفاعلات والديناميكا الحرارية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 5,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy researching nanomaterials for efficient energy conversion.",
    "Q": "J'aime étudier les nanomatériaux pour une conversion d'énergie efficace.",
    "Qar": "أستمتع بدراسة المواد النانوية من أجل تحويل الطاقة بكفاءة.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 2,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 4,
      "hyd-urb": 0, "oth-sci": 1
    }
  },
  {
    "id": "Q",
    "Qen": "I like designing composite materials for structural and mechanical applications.",
    "Q": "J'aime concevoir des matériaux composites pour des applications structurelles et mécaniques.",
    "Qar": "أحب تصميم المواد المركبة للتطبيقات الهيكلية والميكانيكية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 2, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 3,
      "hyd-urb": 0, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy designing and analyzing city water distribution and sewer networks.",
    "Q": "J'aime concevoir et analyser les réseaux de distribution d'eau et d'égouts en milieu urbain.",
    "Qar": "أستمتع بتصميم وتحليل شبكات توزيع المياه وصرف الصرف الصحي في المدن.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 5, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like modeling flood dynamics and river engineering solutions.",
    "Q": "J'aime modéliser la dynamique des inondations et des solutions d'ingénierie fluviale.",
    "Qar": "أحب نمذجة ديناميكا الفيضانات وحلول هندسة الأنهار.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 5, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I am fascinated by wastewater treatment design and urban drainage systems.",
    "Q": "Je suis fasciné par la conception des stations d'épuration et des systèmes de drainage urbain.",
    "Qar": "أنا مفتون بتصميم محطات معالجة مياه الصرف وأنظمة الصرف الصحي الحضرية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 5, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like integrating turbines and pumps for small-scale hydroelectric plants.",
    "Q": "J'aime intégrer des turbines et des pompes pour les petites centrales hydroélectriques.",
    "Qar": "أحب دمج التوربينات والمضخات للمحطات الكهرومائية صغيرة الحجم.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 3,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 3, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy using GIS to map urban infrastructure and plan smart cities.",
    "Q": "J'aime utiliser les SIG pour cartographier l'infrastructure urbaine et planifier des villes intelligentes.",
    "Qar": "أستمتع باستخدام نظم المعلومات الجغرافية لرسم خرائط البنية التحتية الحضرية وتخطيط المدن الذكية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 2, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 3, "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy studying nanoscale materials and nanofabrication processes.",
    "Q": "J'aime étudier les matériaux à l'échelle nanométrique et les processus de nanofabrication.",
    "Qar": "أستمتع بدراسة المواد على المستوى النانوي وعمليات تصنيع النانو.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 5
    }
  },
  {
    "id": "Q",
    "Qen": "I like exploring marine biology and coastal ecosystem management.",
    "Q": "J'aime explorer la biologie marine et la gestion des écosystèmes côtiers.",
    "Qar": "أحب استكشاف علم الأحياء البحرية وإدارة النظم البيئية الساحلية.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 5
    }
  },
  {
    "id": "Q",
    "Qen": "I am fascinated by industrial hygiene, safety audits, and risk assessments.",
    "Q": "Je suis fasciné par l'hygiène industrielle, les audits de sécurité et les évaluations des risques.",
    "Qar": "أنا مفتون بالصحة الصناعية وتدقيقات السلامة وتقييمات المخاطر.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 5
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy designing sensor networks for smart city monitoring and data collection.",
    "Q": "J'aime concevoir des réseaux de capteurs pour la surveillance des villes intelligentes et la collecte de données.",
    "Qar": "أستمتع بتصميم شبكات أجهزة الاستشعار لمراقبة المدن الذكية وجمع البيانات.",
    "weights": {
      "cmp-ias": 2, "elc-oto": 0, "gen-eng": 0, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 2, "oth-sci": 3
    }
  },
  {
    "id": "Q",
    "Qen": "I like developing robotic systems for underwater exploration and maintenance.",
    "Q": "J'aime développer des systèmes robotiques pour l'exploration et la maintenance sous-marine.",
    "Qar": "أحب تطوير الأنظمة الروبوتية للاستكشاف والصيانة تحت الماء.",
    "weights": {
      "cmp-ias": 0, "elc-oto": 2, "gen-eng": 1, "ren-eng": 0,
      "fnd-sci": 0, "ert-env": 0, "agr-abt": 0, "smt-phc": 0,
      "hyd-urb": 0, "oth-sci": 3
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy writing and debugging code in my free time.",
    "Q": "J'aime écrire et déboguer du code pendant mon temps libre.",
    "Qar": "أستمتع بكتابة وتصحيح الشفرات في وقت فراغي.",
    "weights": {
      "cmp-ias": 5,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I am fascinated by neural network architectures and deep learning.",
    "Q": "Je suis fasciné par les architectures de réseaux de neurones et l’apprentissage profond.",
    "Qar": "أنا مفتون بهياكل الشبكات العصبية والتعليم العميق.",
    "weights": {
      "cmp-ias": 5,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like participating in hacking competitions and coding challenges.",
    "Q": "J'aime participer à des compétitions de hacking et des défis de codage.",
    "Qar": "أحب المشاركة في مسابقات الهاكينج وتحديات البرمجة.",
    "weights": {
      "cmp-ias": 5,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy optimizing algorithms and analyzing their mathematical complexity.",
    "Q": "J'aime optimiser des algorithmes et analyser leur complexité mathématique.",
    "Qar": "أستمتع بتحسين الخوارزميات وتحليل تعقيدها الرياضي.",
    "weights": {
      "cmp-ias": 4,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 3,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like programming microcontrollers and embedded systems.",
    "Q": "J'aime programmer des microcontrôleurs et des systèmes embarqués.",
    "Qar": "أحب برمجة المتحكمات الدقيقة وأنظمة المضمنة.",
    "weights": {
      "cmp-ias": 3,
      "elc-oto": 2,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy building and soldering electronic circuits on a breadboard.",
    "Q": "J'aime monter et souder des circuits électroniques sur une plaque d'essai.",
    "Qar": "أستمتع بتجميع ولحام الدوائر الإلكترونية على لوحة تجارب.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 5,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like programming PLCs and designing automated control sequences.",
    "Q": "J'aime programmer des automates programmables et concevoir des séquences de contrôle automatisé.",
    "Qar": "أحب برمجة المتحكمات المنطقية القابلة للبرمجة وتصميم تسلسلات التحكم الآلي.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 5,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy analyzing electric motor performance and control strategies.",
    "Q": "J'aime analyser la performance des moteurs électriques et les stratégies de contrôle.",
    "Qar": "أستمتع بتحليل أداء المحركات الكهربائية واستراتيجيات التحكم.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 5,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like integrating solar panels with power electronics converters.",
    "Q": "J'aime intégrer des panneaux solaires avec des convertisseurs d'électronique de puissance.",
    "Qar": "أحب دمج الألواح الشمسية مع محولات الطاقة الإلكترونية.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 4,
      "ren-eng": 3,
      "gen-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy designing circuits for robotics and mechanical systems.",
    "Q": "J'aime concevoir des circuits pour la robotique et les systèmes mécaniques.",
    "Qar": "أستمتع بتصميم الدوائر للروبوتات والأنظمة الميكانيكية.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 3,
      "gen-eng": 2,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy sketching and simulating mechanical parts in CAD software.",
    "Q": "J'aime esquisser et simuler des pièces mécaniques dans un logiciel CAD.",
    "Qar": "أستمتع برسم أجزاء ميكانيكية ومحاكاتها في برامج التصميم بمساعدة الحاسوب.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 5,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like planning and supervising construction or manufacturing projects.",
    "Q": "J'aime planifier et superviser des projets de construction ou de fabrication.",
    "Qar": "أحب تخطيط والإشراف على مشاريع البناء أو التصنيع.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 5,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy studying fluid dynamics and structural analysis.",
    "Q": "J'aime étudier la dynamique des fluides et l'analyse structurelle.",
    "Qar": "أستمتع بدراسة ديناميكا السوائل والتحليل الهيكلي.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 5,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like optimizing energy consumption in mechanical and electrical installations.",
    "Q": "J'aime optimiser la consommation d'énergie dans les installations mécaniques et électriques.",
    "Qar": "أحب تحسين استهلاك الطاقة في التركيبات الميكانيكية والكهربائية.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 2,
      "gen-eng": 3,
      "ren-eng": 3,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy troubleshooting hydraulic systems in urban infrastructure.",
    "Q": "J'aime dépanner les systèmes hydrauliques dans l'infrastructure urbaine.",
    "Qar": "أستمتع باستكشاف أنظمة الهيدروليك في البنية التحتية الحضرية.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 2,
      "hyd-urb": 3,
      "ren-eng": 0,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy designing photovoltaic systems and solar trackers.",
    "Q": "J'aime concevoir des systèmes photovoltaïques et des suiveurs solaires.",
    "Qar": "أستمتع بتصميم أنظمة الطاقة الشمسية والمتعقبات الشمسية.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 5,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like modeling wind turbine aerodynamics and power output.",
    "Q": "J'aime modéliser l'aérodynamique des éoliennes et leur production d'énergie.",
    "Qar": "أحب نمذجة ديناميكا الهواء للتوربينات الهوائية وإنتاجها من الطاقة.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 5,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy analyzing thermal solar plant efficiency and heat transfer.",
    "Q": "J'aime analyser l'efficacité des centrales solaires thermiques et le transfert de chaleur.",
    "Qar": "أستمتع بتحليل كفاءة محطات الطاقة الشمسية الحرارية وانتقال الحرارة.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 5,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like integrating renewable energy into urban water and heating systems.",
    "Q": "J'aime intégrer les énergies renouvelables dans les systèmes urbains d'eau et de chauffage.",
    "Qar": "أحب دمج مصادر الطاقة المتجددة في أنظمة المياه والتدفئة الحضرية.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 4,
      "hyd-urb": 3,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy studying material properties for efficient energy conversion.",
    "Q": "J'aime étudier les propriétés des matériaux pour une conversion d'énergie efficace.",
    "Qar": "أستمتع بدراسة خصائص المواد من أجل تحويل الطاقة بكفاءة.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 3,
      "smt-phc": 2,
      "fnd-sci": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy proving mathematical theorems and solving abstract problems.",
    "Q": "J'aime démontrer des théorèmes mathématiques et résoudre des problèmes abstraits.",
    "Qar": "أستمتع بإثبات النظريات الرياضية وحل المشكلات المجردة.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 5,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like conducting physics experiments to understand fundamental forces.",
    "Q": "J'aime réaliser des expériences de physique pour comprendre les forces fondamentales.",
    "Qar": "أحب إجراء تجارب فيزيائية لفهم القوى الأساسية.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 5,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy studying differential equations and their real-world applications.",
    "Q": "J'aime étudier les équations différentielles et leurs applications concrètes.",
    "Qar": "أستمتع بدراسة المعادلات التفاضلية وتطبيقاتها العملية.",
    "weights": {
      "cmp-ias": 0,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 5,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I like applying linear algebra in computer graphics and simulations.",
    "Q": "J'aime appliquer l'algèbre linéaire en infographie et en simulations.",
    "Qar": "أحب تطبيق الجبر الخطي في الرسومات الحاسوبية والمحاكاة.",
    "weights": {
      "cmp-ias": 2,
      "elc-oto": 0,
      "gen-eng": 0,
      "ren-eng": 0,
      "fnd-sci": 4,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "hyd-urb": 0,
      "oth-sci": 0
    }
  },
  {
    "id": "Q",
    "Qen": "I enjoy using calculus to model natural phenomena like fluid flow.",
    "Q": "J'aime utiliser le calcul différentiel pour modéliser des phénomènes naturels comme l'écoulement des fluides.",
    "Qar": "أستمتع باستخدام التفاضل والتكامل لنمذجة الظواهر الطبيعية مثل تدفق السوائل.",
    "weights": {
      "gen-eng": 2,
      "ren-eng": 0,
      "fnd-sci": 4,
      "hyd-urb": 2,
      "cmp-ias": 0,
      "elc-oto": 0,
      "ert-env": 0,
      "agr-abt": 0,
      "smt-phc": 0,
      "oth-sci": 0
    }
  }
]
