[
  {
    "id": "Q",
    "en": "I enjoy studying supply and demand curves and their impact on markets.",
    "Q": "J'aime étudier les courbes d'offre et de demande et leur impact sur les marchés.",
    "ar": "أستمتع بدراسة منحنيات العرض والطلب وتأثيرها على الأسواق.",
    "weights": {
      "cmr-sci": 2,
      "fin-ctb": 1,
      "mng-ecn": 3,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 5
    }
  },
  {
    "id": "Q",
    "en": "I find bookkeeping and preparing financial statements interesting.",
    "Q": "Je trouve la tenue de livres et la préparation des états financiers intéressantes.",
    "ar": "أجد مسك الدفاتر وإعداد البيانات المالية ممتعًا.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 5,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 2,
      "ecn-sci": 1
    }
  },
  {
    "id": "Q",
    "en": "I like brainstorming marketing campaigns and designing promotional materials.",
    "Q": "J'aime concevoir des campagnes marketing et élaborer des supports promotionnels.",
    "ar": "أحب التفكير في حملات التسويق وتصميم المواد الترويجية.",
    "weights": {
      "cmr-sci": 5,
      "fin-ctb": 0.5,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 2
    }
  },
  {
    "id": "Q",
    "en": "I often analyze company balance sheets to assess financial health.",
    "Q": "J'analyse souvent les bilans des entreprises pour évaluer leur santé financière.",
    "ar": "أقوم غالبًا بتحليل البيانات المالية للشركات لتقييم صحتها المالية.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 5,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 2
    }
  },
  {
    "id": "Q",
    "en": "I am interested in how companies set prices and maximize profits.",
    "Q": "Je m'intéresse à la façon dont les entreprises fixent les prix et maximisent leurs profits.",
    "ar": "أنا مهتم بكيفية قيام الشركات بتحديد الأسعار وتعظيم الأرباح.",
    "weights": {
      "cmr-sci": 2,
      "fin-ctb": 1,
      "mng-ecn": 5,
      "fds-sci": 0.5,
      "mng-sci": 2,
      "ecn-sci": 3
    }
  },
  {
    "id": "Q",
    "en": "I enjoy organizing group projects and leading teams to meet objectives.",
    "Q": "J'aime organiser des projets de groupe et diriger des équipes pour atteindre des objectifs.",
    "ar": "أستمتع بتنظيم المشاريع الجماعية وقيادة الفرق لتحقيق الأهداف.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 0.5,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 5,
      "ecn-sci": 1
    }
  },
  {
    "id": "Q",
    "en": "I like evaluating economic policies and their effects on society.",
    "Q": "J'aime évaluer les politiques économiques et leurs effets sur la société.",
    "ar": "أحب تقييم السياسات الاقتصادية وتأثيرها على المجتمع.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 0.5,
      "mng-ecn": 3,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 5
    }
  },
  {
    "id": "Q",
    "en": "I enjoy experimenting with recipes and understanding food preservation methods.",
    "Q": "J'aime expérimenter des recettes et comprendre les méthodes de conservation des aliments.",
    "ar": "أستمتع بتجربة الوصفات وفهم طرق حفظ الأغذية.",
    "weights": {
      "cmr-sci": 0.5,
      "fin-ctb": 0.5,
      "mng-ecn": 1,
      "fds-sci": 5,
      "mng-sci": 1,
      "ecn-sci": 0.5
    }
  },
  {
    "id": "Q",
    "en": "I often track stock market indices and financial news.",
    "Q": "Je suis souvent les indices boursiers et l'actualité financière.",
    "ar": "أتتبع غالبًا مؤشرات البورصة والأخبار المالية.",
    "weights": {
      "cmr-sci": 2,
      "fin-ctb": 4,
      "mng-ecn": 1,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 3
    }
  },
  {
    "id": "Q",
    "en": "I like discussing case studies of successful businesses.",
    "Q": "J'aime discuter des études de cas d'entreprises prospères.",
    "ar": "أحب مناقشة دراسات حالة للشركات الناجحة.",
    "weights": {
      "cmr-sci": 3,
      "fin-ctb": 1,
      "mng-ecn": 4,
      "fds-sci": 0.5,
      "mng-sci": 2,
      "ecn-sci": 1
    }
  },
  {
    "id": "Q",
    "en": "I enjoy calculating profit margins and cost analyses in class.",
    "Q": "J'apprécie calculer les marges bénéficiaires et les analyses de coûts en cours.",
    "ar": "أستمتع بحساب هوامش الربح وتحليلات التكلفة في الصف.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 4,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 2
    }
  },
  {
    "id": "Q",
    "en": "I like negotiating prices when shopping or selling items online.",
    "Q": "J'aime négocier les prix lors de mes achats ou de la vente d'articles en ligne.",
    "ar": "أحب التفاوض على الأسعار عند التسوق أو بيع الأشياء عبر الإنترنت.",
    "weights": {
      "cmr-sci": 5,
      "fin-ctb": 1,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 1
    }
  },
  {
    "id": "Q",
    "en": "I am interested in supply chain management and logistics.",
    "Q": "Je m'intéresse à la gestion de la chaîne d'approvisionnement et à la logistique.",
    "ar": "أنا مهتم بإدارة سلسلة التوريد واللوجستيات.",
    "weights": {
      "cmr-sci": 2,
      "fin-ctb": 0.5,
      "mng-ecn": 4,
      "fds-sci": 0.5,
      "mng-sci": 3,
      "ecn-sci": 1
    }
  },
  {
    "id": "Q",
    "en": "I like budgeting my personal expenses and tracking my savings goals.",
    "Q": "J'aime budgéter mes dépenses personnelles et suivre mes objectifs d'épargne.",
    "ar": "أحب وضع ميزانية لنفقاتي الشخصية وتتبع أهدافي في الادخار.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 5,
      "mng-ecn": 1,
      "fds-sci": 0.5,
      "mng-sci": 2,
      "ecn-sci": 1
    }
  },
  {
    "id": "Q",
    "en": "I enjoy reading business news magazines and financial journals.",
    "Q": "J'aime lire des magazines économiques et des revues financières.",
    "ar": "أستمتع بقراءة المجلات التجارية والدوريات المالية.",
    "weights": {
      "cmr-sci": 2,
      "fin-ctb": 2,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 3
    }
  },
  {
    "id": "Q",
    "en": "I am passionate about optimization of processes and efficiency improvements.",
    "Q": "Je suis passionné par l'optimisation des processus et l'amélioration de l'efficacité.",
    "ar": "أنا شغوف بتحسين العمليات وزيادة الكفاءة.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 0.5,
      "mng-ecn": 3,
      "fds-sci": 0.5,
      "mng-sci": 5,
      "ecn-sci": 1
    }
  },
  {
    "id": "Q",
    "en": "I like studying consumer behavior and market segmentation in class.",
    "Q": "J'aime étudier le comportement des consommateurs et la segmentation du marché en cours.",
    "ar": "أحب دراسة سلوك المستهلكين وتقسيم السوق في الصف.",
    "weights": {
      "cmr-sci": 5,
      "fin-ctb": 1,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 2
    }
  },
  {
    "id": "Q",
    "en": "I enjoy analyzing food production processes and quality controls.",
    "Q": "J'aime analyser les processus de production alimentaire et les contrôles qualité.",
    "ar": "أستمتع بتحليل عمليات إنتاج الأغذية ومراقبة الجودة.",
    "weights": {
      "cmr-sci": 0.5,
      "fin-ctb": 0.5,
      "mng-ecn": 1,
      "fds-sci": 5,
      "mng-sci": 2,
      "ecn-sci": 0.5
    }
  },
  {
    "id": "Q",
    "en": "I like creating business plans and financial forecasts for school projects.",
    "Q": "J'aime créer des plans d'affaires et des prévisions financières pour les projets scolaires.",
    "ar": "أحب إعداد خطط الأعمال والتوقعات المالية للمشاريع المدرسية.",
    "weights": {
      "cmr-sci": 2,
      "fin-ctb": 3,
      "mng-ecn": 4,
      "fds-sci": 0.5,
      "mng-sci": 2,
      "ecn-sci": 2
    }
  },
  {
    "id": "Q",
    "en": "I often discuss macroeconomic trends and global markets with friends.",
    "Q": "Je discute souvent des tendances macroéconomiques et des marchés mondiaux avec mes amis.",
    "ar": "أنا غالبًا ما أناقش الاتجاهات الاقتصادية الكلية والأسواق العالمية مع أصدقائي.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 0.5,
      "mng-ecn": 3,
      "fds-sci": 0.5,
      "mng-sci": 1,
      "ecn-sci": 5
    }
  },
  {
    "id": "Q",
    "en": "I like organizing events and managing budgets for school clubs.",
    "Q": "J'aime organiser des événements et gérer les budgets des clubs scolaires.",
    "ar": "أحب تنظيم الفعاليات وإدارة الميزانيات لأندية المدرسة.",
    "weights": {
      "cmr-sci": 1,
      "fin-ctb": 2,
      "mng-ecn": 2,
      "fds-sci": 0.5,
      "mng-sci": 5,
      "ecn-sci": 1
    }
  }
]
